In [1]:
import pandas as pd

data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [2]:
employee.merge(employee, left_on='managerId', right_on='id')

   id_x name_x  salary_x  managerId_x  id_y name_y  salary_y  managerId_y
0     1    Joe     70000            3     3    Sam     60000         <NA>
1     2  Henry     80000            4     4    Max     90000         <NA>

In [3]:
# 默认参数 suffixes=("_x", "_y")
merged = employee.merge(employee, left_on='managerId', right_on='id', suffixes=('_emp', '_mgr'))
merged

,id_emp,name_emp,salary_emp,managerId_emp,id_mgr,name_mgr,salary_mgr,managerId_mgr
0,1,Joe,70000,3,3,Sam,60000,<NA>
1,2,Henry,80000,4,4,Max,90000,<NA>

In [4]:
result = merged.loc[merged['salary_emp'] > merged['salary_mgr'], ['name_emp']]
result

  name_emp
0      Joe

In [5]:
result.rename(columns={'name_emp':'Employee'})

  Employee
0      Joe